---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalHardPoints
source: html/85d83276-ea23-5ad7-440f-667d93fde3c8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalHardPoints Property

"Use hard-points"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAnalyticalHardPoints { get; }
```